# Завдання 1
# Створити список чисел в діапазоні 10, 250, необхідно видалити всі входження чисел, які
# діляться без остачі на 20, із нього. Вивести результат список в термінал.
#

list_a = list(range(10, 251))
list_b =[]

for i in range(len(list_a)):
    if list_a[i] % 20 == 0:
        list_b.append(list_a[i])

print(list_a)  #Створений нами список list_a
new_list = list(set(list_a) - set(list_b)) #Видалили всі входження в список List_a, які діляться на 20 без остачі
print(new_list) #Результат
