# Завдання 3
#
# Є 2 списки:
# [1, 2, 5, 7, 9, 99, 87, 200, 39, 2]
# [5, 42, 29, 345, 50, 33, 7, 0, 201, 9, 2, 132, 45, 23,934]
# Порахувати скільки разів числа з одного списку зустрічаються у ішому списку. Вивести у вигляді відформатованої таблиці.

list_a = [1, 2, 5, 7, 9, 99, 87, 200, 39, 2]
list_b = [5, 42, 29, 345, 50, 33, 7, 0, 201, 9, 2, 132, 45, 23,934]

for i in range(0,len(list_a)):
    print('Елемент {:^5} зі списку List_a зустрічається {:^3} разів у списку List_b'.format(list_a[i], list_b.count(list_a[i])))
print('\n')

for i in range(0,len(list_b)):
    print('Елемент {:^5} зі списку List_b зустрічається {:^3} разів у списку List_a'.format(list_b[i], list_a.count(list_b[i])))