# У Грегоріанському календарі використовуються 3 умови виявлення високосного року.
#
# Рік можна без залишку розділити на 4, це високосний рік, якщо:
#
#            Рік можна розділити порівну на 100, це не високосний рік, якщо:
#
#                         Рік також ділиться на 400 без залишку. Тоді це високосний рік.
#
# Це означає, що у Григоріанському календарі 2000 та 2400 роки є високосними, а 1800, 1900, 2100, 2200, 2300 та 2500 - Не Є високосними.
#
# Завдання: Створити програму яка просить рік для перевірки, перевіряє що введено цифри що означають рік та відповідає наступним вимогам:
#
# 1. Рік який введено повинен бути в диапазоні 1900 < рік < 1_000_000
#
#  Якщо рік не в диапазоні - повідомити що рік не відповідає умовам - і закінчити роботу програми.
#
# 2. Якщо рік відповідає вимогам - провести перевірку на високостний\невисокостний і повідомити в термінал. Наприклад: “1987 is not leep year”“


year = int(input('Введіть рік в діапазоні від 1900 до 1000000 >>> '))
if year < 1900 or year > 1000000:
    print('Рік не відповідає вимогам введення!')
else:
    if year % 4 == 0 and (year % 100 != 0 or year % 400 == 0):
        print('%s рік є високосним' % year)
    else:
        print('%s рік не є високосним' % year)
