# N школярів ділять К яблук порівну, остача залишається в корзинці.
# Скільки яблук дістанеться кожому школяру ? Скільки яблук залишиться в корзинці.
# Програма отримує на вхід числа N та K і повинна вивести 2 значення:
# 1. Кожному школяру дісталося яблук
# 2. Яблук залишилось в корзинці
# Використовувати лише арифметичні оператори( Підказка: вам знадобляться // та %)

n = int(input('Введіть кількість школярів >>> '))
k = int(input('Введіть кількість яблук >>> '))
apples_for_children = k // n
remained = k % n

if n > k:
    print('Кількість яблук повинна бути більшою, аніж кількість школярів, щоб нікого не залишити голодним :)')
else:
    print('Кожному школяру дісталося по %s яблука' % apples_for_children)
    print( '%s яблук залишилось в корзинці' % remained)