# В школі вирішили набрати 3 нових математичинх класи. Заняття проходять в один і той самий час, тому виділили 3 різних кабінети.
# За партою може сидіти не більше 2 учнів. Відома кількість учнів в кожному з 3х класів.
# Скільки потрібно закупити парт щоб вистачило на усіх учнів? Програма отримує на вхід 3 натуральних числа: кількість учнів у класі.
#
# Використовувати лише арифметичні оператори( Підказка: вам знадобляться // та %)

first_classroom = int(input('Введіть кількість учнів у першому класі >>> '))
second_classroom = int(input('Введіть кількість учнів у другому класі >>> '))
third_classroom = int(input('Введіть кількість учнів у третьому класі >>> '))

first_desks = first_classroom // 2
second_desks = second_classroom // 2
third_desks = third_classroom // 2

if first_classroom % 2 == 0:
    print('Для першого класу необхідно %s парт' % first_desks)
else:
    print('Для першого класу необхідно %s парт' % (first_desks + 1))

if second_classroom % 2 == 0:
    print('Для другого класу необхідно %s парт' % second_desks)
else:
    print('Для другого класу необхідно %s парт' % (second_desks + 1))

if third_classroom % 2 == 0:
    print('Для третього класу необхідно %s парт' % third_desks)
else:
    print('Для третього класу необхідно %s парт' % (third_desks + 1))