# Потрібен кредитний калькулятор, який може прорахувати виплати,
# які потрібно робити клієнту кожного місяця для погашення всього кредиту.
# Кредит береться клієнтом в установі під певний процент - 2% в місяць перші 2 роки та 4% в місяць наступні роки.
# Процент нараховується що місяця на остачу що залишилaся після виплати.
#
# Програма запитує суму кредиту у клієнта.
#
# Вивести помісячно суму яку потрібно тратити клієнту щоб розрахуватися з кредитом за 1, за 5 років.
#
# Очікується що вивід буде оформлений в у вигляді симетрично відофрматованих стовбців.
#
# Повино бути присутнім у виводі інформаціі - номер місяця, сума виплати за місяць, та скільки процентів нараховано за місяць.

input_sum = int(input('Введіть суму кредиту >>> '))
one_year = 12
five_year = 60
input_time = input('Напишіть термін кредиту \n цифру 1, якщо кредит на 1 рік\n цифру 5, якщо кредит на 5 років \n >>> ')

valyuta = '$'
if input_time == '1':
    suma = input_sum / one_year
    for i in range(1, one_year + 1):
        input_sum -= suma
        persent = input_sum * 0.02
        print('сума виплат за {:>2} місяць:{:>10} {:<10} залишок на виплату:{:>10}$'.format(i , int(suma + persent), valyuta, int(input_sum)))

if input_time == '5':
    suma = input_sum / five_year
    for i in range(1, five_year + 1):
        input_sum -= suma
        persent = input_sum * 0.02
        # print('сума виплат за {:>2} місяць:{:>10} {:<10} залишок на виплату:{:>10}$'.format(i , int(suma + persent), valyuta, int(input_sum)))
        # print(persent)
        if i > 24:
            persent = input_sum * 0.04
        print('сума виплат за {:>2} місяць:{:>10} {:<10} залишок на виплату:{:>10}$'.format(i , int(suma + persent), valyuta, int(input_sum)))


