# 2. Дано два списки чисел. Порахуйте, скільки різних чисел міститься як у першому списку, і у другому оночасно.
#    - Примітка. Це завдання на python можна вирішити в один рядок.
#
# PS: Різних чисел - мається на увазі що усі однакові елементи повинні бути представленні в одному екземплярі
# (приклад: 3 однаковиі числа мають бути пораховані як 1 елемент)

import random

first_list = [random.randint(0, 50) for i in range(30)]
second_list = [random.randint(0, 50) for i in range(30)]

print('Ми маємо 2 списки чисел: \n',first_list,'\n',second_list)
print('У першому і у другому списку чисел одночасно міститься {} різних чисел'.format(len(set(first_list + second_list))))