# Реалізувати додаток, який приймає на вхід значення чисел від 3 до 9;
# Виконує перевірку на правильність введеного числа у вказаному діапазоні.
# Якщо не в діапазоні або не число – повідомляє про проблему та закінчує роботу.
#
# Інакше - друкує піраміду з чисел. Введене число позначає кількість надрукованих рядів, а перший ряд складається з '1'.

input_number = int(input('Введіть число від 3 до 9 >>> '))
if input_number >= 3 and input_number <= 9:
    numbers = ""
    for x in range(1, input_number + 1):
       numbers += str(x)
       result_number = numbers + numbers[-2::-1]
       print(result_number)
else:
    print('Некоректний ввід')