# Дано рядок (отримати рядок з терміналу від користувача ). Домовимось рядок більше 15 символів.

input_str = input('Введіть рядок мінімум з 15 симвволів >>> ')
if len(input_str) >= 15:
#a. виведіть третій символ цього рядка.
    print(input_str[2])

# b. виведіть передостанній символ цього рядка.
    print(input_str[-2])oploo-0

# c. виведіть перші п'ять символів цього рядка.
    print(input_str[0:5])

# d. виведіть весь рядок, крім двох останніх символів.
    print(input_str[:-2])

# e. виведіть усі символи з парними індексами (вважаючи, що індексація починається з 0,
# тому символи виводяться починаючи) з першого).
    print(input_str[0::2])

# f. виведіть усі символи з непарними індексами, тобто, починаючи з другого символу рядка.
    print(input_str[1::2])

# g. виведіть усі символи у зворотному порядку.
    print(input_str[::-1])

# h. виведіть усі символи рядка через один у зворотному порядку, починаючи з останнього.
    print(input_str[::-2])
# i. виведіть довжину цього рядка.
    print(ascii(len(input_str)))
else:
    print('Некоректний ввід, рядок має бути мінімум 15 символів')