'''
Написати функцію яка приймає на вхід параметри: список(або генератор виразу) чисел
будь - якої довжини та число.

Функція повинна перевірити чи є у списку 2 числа сума яких еквівалентна числу переданому 2м
параметром. Функція має повернути булеве значення як результат пошуку фукції.

Для перевірки викликати двічі функцію з різними тестовими прикладами
'''

# def sum_numb (a, b):
# k = list(range(1, a))
#     for x in k:
#         if x + k[x] == b:
#             print('yes')
#             x+=1
#         else:
#             print('not')
#
# sum_numb(4, 9)