'''
Написати функцію яка приймає на вхід параметри: список(або генератор виразу) чисел
будь - якої довжини та число.

Функція повинна перевірити чи є у списку 2 числа сума яких еквівалентна числу переданому 2м
параметром. Функція має повернути булеве значення як результат пошуку фукції.

Для перевірки викликати двічі функцію з різними тестовими прикладами
'''

def sum_numb (a, b):

    '''Функція перевіряє чи є у списку 2 числа сума яких еквівалентна числу переданому 2м
параметром. Функція повертає булеве значення як результат пошуку фукції.'''

    for x in a:
        if b - x in a:
            # print(True,' = ', x, b - x) таким чином можна побачити перші відповідні значення
            return print(True)
        else:
            return print(False)

sum_numb([3, 6, 11, 20, 8, 11, 10, 13, 4, 9 , 10 ,3, 4, 2, 5, 7 ,8], 13)

sum_numb(list(range(0,15,3)), 23)