'''
написати анонімну функцію яка приймає 2 значення x,y де y по
замовчуванням == числу . Результат роботи функції – число x у ступені y.
Використовуючи функцію map отримати список чисел, які були створені в результаті
застосування лямбда функції до кожного елемента ітеруємого(мих) об'єкта(ів) який(і) ви можете створити як заманеться.
Для перевірки навести 2 тестових приклади у консоль:
1 коли передається один список для обробки у map
2 коли передається 2 списки чисел для обробки у map
'''

func_1 = lambda x, y = 5: x ** y
print(func_1(2 ,4))

result_map = map(func_1, range(1, func_1(2 ,4)))
print(list(result_map))

result_map = map(func_1, range(1, func_1(2 ,4)), range(1, func_1(2 ,4)))
print(list(result_map))