# Завдання 2 (опціонально +5 до роботи)
#
# Створіть словник із випадковими числовими значеннями довжиною в 20 елементів.
# Необхідно їх (числові значення) перемножити і вивести на екран згенерований на початку словник
# та результат множення чисел.



import random

list_a = [random.randint(1, 10) for i in range(20)]
list_b = [x for x in range(1, 21)]
print('Згенерований словник - ', dict(zip(list_b, list_a)))

x = 1   # змінна для збереження значення добутку
for item in list_a: x = x * item
print ('Добуток всіх числових значень словника =', x)




