# Завдання 6*
# Дано текст:
#
# “Любіть Україну, як сонце любіть,
# як вітер, і трави, і води...
# В годину щасливу і в радості мить,
# любіть у годину негоди.
#
# Любіть Україну у сні й наяву,
# вишневу свою Україну,
# красу її, вічно живу і нову,
# і мову її солов'їну.
#
# Без неї — ніщо ми, як порох і дим,
# розвіяний в полі вітрами...
# Любіть Україну всім серцем своїм
# і всіми своїми ділами.”
#
# Створіть з цього тексту словник де ключем обо значенням буде слово (як вам зручніше) з тексту.
# А значенням або ключем буде ціле число що характеризує скількі разів слово зустрілось у тексті.
# (Памятайте що у тексті є розділові знаки - їх потрібно позбутися спочатку.)
#
# Виведіть 2 значення:
# - яке слово і скільки разів зусрічається найбільше?
# - яке слово і скільки разів зусрічається найменше? (опціонально)

key_list = 'Любіть Україну, як сонце любіть, ' \
           'як вітер, і трави, і води... ' \
           'В годину щасливу і в радості мить, ' \
           'любіть у годину негоди. ' \
           '' \
           'Любіть Україну у сні й наяву, ' \
           'вишневу свою Україну, ' \
           'красу її, вічно живу і нову, ' \
           'і мову її солов\'їну. ' \
           '' \
           'Без неї — ніщо ми, як порох і дим, ' \
           'розвіяний в полі вітрами... ' \
           'Любіть Україну всім серцем своїм ' \
           'і всіми своїми ділами.'


key_list = key_list.replace(',', '')
key_list = key_list.replace("'", "")
key_list = key_list.replace(' — ', '')
key_list = key_list.replace('.', '')
key_list = key_list.split(' ')
# print(key_list)

value_list =[]
for i in range(0, len(key_list)):
    value_list.append(key_list.count(key_list[i]))
# print(value_list)

new_dict = dict(zip(key_list, value_list))
print(new_dict)

max_value = max(new_dict.values())
min_value = min(new_dict.values())

print('Слова, які зустрічаються найбільше і найменше у даному вірші:')

for key, value in new_dict.items():
    if value == max_value:
        print(key, '=', value)
    if value == min_value:
        print(key, '=', value)